app/views/books/index.html.erb

SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", "3"]]
---
					<!-- いいね　end -->
					<td><%= book.post_comments.count %>件</td>